Documents/Заявка_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>Заявка_ат</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Общая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованияЗаявок_ат</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКлиентов_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РодительскаяЗаявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>TODO - ren</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тезис</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗаявкиВHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тикет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЗаявок_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_ВнутреннийКомментарийВHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_ОжидаемаяДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Причастные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКлиентов_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипУведомления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыУведомлений_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отправлять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СтатусыЗаявок_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявок_ат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пожелание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарегистрирована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРассмотрении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОжиданииОтвета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаВнутреннемСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОчереди</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаТестировании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОжиданииРелиза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПриемке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Заявка_ат/Ext/ObjectModule.bsl
//!!ТУДУ: осуществлять контроль корректности заполнения полей (реквизитов и записей в РСах)!
//в т.ч. использовать Планирование_Сервер_ат.ПолучитьДочерниеЗадания

Перем ЭтоНовый;
Перем ИзменилосьОснование;
Перем МассивСтруктурУведомлений;
Перем НеобходимоПересчитатьПриоритет;
Перем СоответствиеИменФайловИдентификаторам;

#Область  ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	Автор = Неопределено;
	ДатаСоздания = Неопределено;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		
		Основание = ДанныеЗаполнения;
		Контакты = Взаимодействия.ПолучитьВсеКонтактыПоEmail(ДанныеЗаполнения.ОтправительАдрес);
		
		Для Каждого Контакт Из Контакты Цикл
			
			Если НЕ Контакт.Контакт.Пустая() Тогда
				
				Планирование_Сервер_ат.ПервичноеЗаполнениеСотрудникКлиентПодразделение(Контакт.Контакт, Сотрудник, Клиент, Подразделение);
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Тезис = ДанныеЗаполнения.Тема;
		
		Текст = ОбработчикиСобытийДляПочтовыхДокументов_ат.ПолучитьТексПисьмаИзРегистраСодержаниеЭлектронныхПисем(ДанныеЗаполнения);
		
		Если ДанныеЗаполнения.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст Тогда
			
			ДокументHTML = Взаимодействия.ПолучитьДокументHTMLИзОбычногоТекста(Текст);
			
		ИначеЕсли ДанныеЗаполнения.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML
				Или ДанныеЗаполнения.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTMLСКартинками Тогда
			
			ДокументHTML = Взаимодействия.ПолучитьОбъектДокументHTMLИзТекстаHTML(Текст);
			
		КонецЕсли;
		
		ТекстЗаявкиВHTML = Взаимодействия.ПолучитьТекстHTMLИзОбъектаДокументHTML(ДокументHTML);
		
		Если ДанныеЗаполнения.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTMLСКартинками Тогда
			
			РаботаСHTML_Сервер_ат.ОбработатьКартинкиВHTMLПриСозданииНаОсновании(ДанныеЗаполнения, ТекстЗаявкиВHTML);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если РольДоступна("ОрганизацияМенеджерПроектов_ат")
		ИЛИ РольДоступна("ОрганизацияИсполнитель_ат") Тогда
				
		ПроверяемыеРеквизиты.Добавить("Проект");
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоНовый = ЭтоНовый();
	ИзменилосьОснование = (Основание <> Ссылка.Основание);
	Статус = Планирование_Сервер_ат.ПолучитьТекущийСтатус(Ссылка);
	
	Если Тезис = ВРег(Тезис) Тогда
		Тезис = Лев(Тезис, 1) + НРег(Сред(Тезис, 2));
	КонецЕсли;
	
	Если ЭтоНовый Тогда
		УстановитьНовыйНомер();
	КонецЕсли;
	
	Если ПустаяСтрока(Тикет) Тогда
		
		Если (ЭтоНовый И ДополнительныеСвойства.Свойство("Регистрировать"))
			ИЛИ (НЕ ЭтоНовый И НЕ Статус = Перечисления.СтатусыЗаявок_ат.Черновик) Тогда
		
			Тикет = Строки_КлиентСервер_ат.ПолучитьНомерТикета(Номер, Дата);
			
		КонецЕсли;
		
	КонецЕсли;
	
	//Если НЕ ЭтоНовый Тогда //!!!!!TODO
	//
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//		"ВЫБРАТЬ ПЕРВЫЕ 1
	//		|	Согласование_ат.Ссылка КАК Согласование
	//		|ИЗ
	//		|	Документ.Согласование_ат КАК Согласование_ат
	//		|ГДЕ
	//		|	Согласование_ат.Заявки.Заявка = &Заявка
	//		|	И Согласование_ат.ОтправленоНаСогласование";
	//	Запрос.УстановитьПараметр("Заявка", Ссылка);
	//
	//	Выборка = Запрос.Выполнить().Выбрать();
	//
	//	Если Выборка.Следующий() Тогда
	//		
	//		Отказ = Истина;
	//		
	//		Сообщить("Изменение Заявки находящейся на согласовании запрещено.");
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
	Если ПометкаУдаления Тогда
		
		КоличествоПодчиненныхЗаданий = Планирование_Сервер_ат.ПолучитьДочерниеЗадания(Ссылка, Ложь).Количество();
		Если КоличествоПодчиненныхЗаданий > 0 Тогда
			
			Отказ = Истина;
			Сообщить("Заявка не может быть помечена на удаление т.к. она имеет "
				+ ?(КоличествоПодчиненныхЗаданий = 1, "подчинённое Задание.", "подчинённые Задания."));
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоНовый И НЕ ПометкаУдаления И НЕ Статус = Перечисления.СтатусыЗаявок_ат.Черновик Тогда
		МассивСтруктурУведомлений = Уведомления_ат.ПолучитьМассивСтруктурУведомленийПриИзмененииЗаявки(ЭтотОбъект);
	Иначе
		МассивСтруктурУведомлений = Новый Массив;
	КонецЕсли;
	
	Если НЕ ЭтоНовый И (ПометкаУдаления <> Ссылка.ПометкаУдаления ИЛИ ТипЗаявки <> Ссылка.ТипЗаявки) Тогда
		НеобходимоПересчитатьПриоритет = Истина;
	КонецЕсли;
	
	СоответствиеИменФайловИдентификаторам = Новый Соответствие;
	
	РаботаСHTML_Сервер_ат.ЗаменитьИменаКартинокНаИдентификаторыВHTML(ТекстЗаявкиВHTML, СоответствиеИменФайловИдентификаторам);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Попытка //??? хорошо ли напрочь экранировать ошибку?
		
		Если ЭтоНовый ИЛИ ИзменилосьОснование Тогда
			
			Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
				
				Предмет = ?(Основание.Пустая(), Ссылка, Взаимодействия.ПолучитьЗначениеПредмета(Основание));
				Взаимодействия.УстановитьПредмет(Ссылка, Предмет);
				
				ДобавитьФайлыИзПисьма();
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЭтоНовый Тогда
			
			Планирование_Сервер_ат.УстановитьСтатус(Ссылка,
				?(ДополнительныеСвойства.Свойство("Регистрировать"),
					Перечисления.СтатусыЗаявок_ат.Зарегистрирована, Перечисления.СтатусыЗаявок_ат.Черновик),
				Дата, ДополнительныеСвойства.Свойство("ОтправлятьУведомления"));
			
		КонецЕсли;
		
		Если НеобходимоПересчитатьПриоритет Тогда
			Планирование_Сервер_ат.УстановитьПриоритетЗаявки(Ссылка, Неопределено, Истина);
		КонецЕсли;
		
		РаботаСHTML_Сервер_ат.ЗаписатьПрикрепленныеФайлыКартинок(Ссылка, СоответствиеИменФайловИдентификаторам);
		
	//Исключение //??? хотя бы Сообщить(ОписаниеОшибки()) ?
	//	
	//	Отказ = Истина;
	//	
	//КонецПопытки;
	//
	//Если Отказ Тогда
	//	Возврат;
	//КонецЕсли;
	
	Если МассивСтруктурУведомлений.Количество() > 0 Тогда
		Уведомления_ат.ОтправитьУведомленияИзМассива(МассивСтруктурУведомлений);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область  ДополнительныеПроцедурыИФункции

Процедура ДобавитьФайлыИзПисьма()
	
	Если НЕ ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		Возврат;
	КонецЕсли;
	
	МассивФайлов = Новый Массив;
	
	ПрисоединенныеФайлы.ПолучитьПрикрепленныеФайлыКОбъекту(Основание, МассивФайлов);
	
	Если МассивФайлов.Количество() > 0 Тогда
	
		ПрисоединенныеФайлыПереопределяемый.СкопироватьПрисоединенныеФайлыИзИсточникаДругогоТипа(Основание, Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

НеобходимоПересчитатьПриоритет = Ложь;
МассивСтруктурУведомлений = Новый Массив;
